tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Mozilla CA certificate store
brew "ca-certificates"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Platform built on V8 to build network applications
brew "node"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# App to build and share containerized applications and microservices
cask "docker"
# Git client focusing on productivity
cask "gitkraken"
# Local node for the Nano cryptocurrency
cask "nano"
# Open-source code editor
cask "visual-studio-code"
mas "GeoGebra 5", id: 845142834
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kinoni Barcode Reader", id: 609130746
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OmniPlan", id: 1040002810
mas "Pages", id: 409201541
mas "Roadmap Planner", id: 1072531325
mas "Snappy", id: 512617038
mas "Spark", id: 1176895641
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
